---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
PromptForFamilyInstancePlacementOptions Constructor
PromptForFamilyInstancePlacementOptions Class See Also Send Feedback
---

# Overload List

|  | Name | Description |
| --- | --- | --- |
|  | PromptForFamilyInstancePlacementOptions()()()() | Creates a new PromptForFamilyInstancePlacementOptions using default options. |
|  | PromptForFamilyInstancePlacementOptions(PromptForFamilyInstancePlacementOptions) | Creates a copy of an existing options object. |

# See Also

PromptForFamilyInstancePlacementOptions Class

PromptForFamilyInstancePlacementOptions Members

Autodesk.Revit.UI Namespace